; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v13 ?v2)
             (pred_7 ?v6 ?v3)
             (pred_12 ?v13 ?v3)
             (pred_2 ?v4 ?v13 )
	     (pred_4 ?v13)
             (pred_5 ?v9)
             (pred_9 ?v6)
             (pred_3 ?v3)
             (pred_10 ?v13)
             (pred_6 ?v6)
             (pred_8 ?v13)
             (pred_1 ))



(:action op_2
:parameters (?v11 ?v10 ?v12 ?v8)
:precondition (and (pred_5 ?v11) (pred_5 ?v10) (pred_9 ?v12) (pred_3 ?v8)
          (pred_11 ?v11 ?v10) (pred_7 ?v12 ?v8)
                   (pred_12 ?v10 ?v8) (pred_4 ?v11) 
                   (pred_10 ?v10) (pred_6 ?v12))
:effect (and  (pred_8 ?v10) (not (pred_10 ?v10))))


(:action op_5
:parameters (?v11 ?v7)
:precondition (and (pred_5 ?v11) (pred_5 ?v7)
               (pred_4 ?v11) (pred_11 ?v11 ?v7) (pred_8 ?v7))
:effect (and (pred_4 ?v7) (not (pred_4 ?v11))))

(:action op_1
:parameters (?v11 ?v12)
:precondition (and (pred_5 ?v11) (pred_9 ?v12) 
                  (pred_4 ?v11) (pred_2 ?v12 ?v11) (pred_1 ))
:effect (and (pred_6 ?v12)
   (not (pred_2 ?v12 ?v11)) (not (pred_1 ))))


(:action op_4
:parameters (?v11 ?v5 ?v1)
:precondition (and (pred_5 ?v11) (pred_9 ?v5) (pred_9 ?v1)
                  (pred_4 ?v11) (pred_6 ?v1) (pred_2 ?v5 ?v11))
:effect (and (pred_6 ?v5) (pred_2 ?v1 ?v11)
        (not (pred_6 ?v1)) (not (pred_2 ?v5 ?v11))))

(:action op_3
:parameters (?v11 ?v12)
:precondition (and (pred_5 ?v11) (pred_9 ?v12) 
                  (pred_4 ?v11) (pred_6 ?v12))
:effect (and (pred_1 ) (pred_2 ?v12 ?v11) (not (pred_6 ?v12)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_22 obj_01 obj_29 obj_31 obj_18 obj_28 obj_09 obj_26 obj_20 obj_11 obj_15 obj_02 obj_23 obj_19 obj_07 obj_05 obj_12 obj_16 obj_13 obj_25 obj_10 obj_24 obj_30 obj_14 obj_08
    obj_04 obj_17 obj_27
    obj_03 obj_21 obj_06
    )

    (:init
       (pred_1)

       (pred_5 obj_22)
       (pred_5 obj_01)
       (pred_5 obj_29)
       (pred_5 obj_31)
       (pred_5 obj_18)
       (pred_5 obj_28)
       (pred_5 obj_09)
       (pred_5 obj_26)
       (pred_5 obj_20)
       (pred_5 obj_11)
       (pred_5 obj_15)
       (pred_5 obj_02)
       (pred_5 obj_23)
       (pred_5 obj_19)
       (pred_5 obj_07)
       (pred_5 obj_05)
       (pred_5 obj_12)
       (pred_5 obj_16)
       (pred_5 obj_13)
       (pred_5 obj_25)
       (pred_5 obj_10)
       (pred_5 obj_24)
       (pred_5 obj_30)
       (pred_5 obj_14)
       (pred_5 obj_08)
       (pred_3 obj_04)
       (pred_3 obj_17)
       (pred_3 obj_27)
       (pred_9 obj_03)
       (pred_9 obj_21)
       (pred_9 obj_06)

       (pred_11 obj_22 obj_28)
       (pred_11 obj_22 obj_01)
       (pred_11 obj_01 obj_09)
       (pred_11 obj_01 obj_29)
       (pred_11 obj_01 obj_22)
       (pred_11 obj_29 obj_26)
       (pred_11 obj_29 obj_31)
       (pred_11 obj_29 obj_01)
       (pred_11 obj_31 obj_20)
       (pred_11 obj_31 obj_18)
       (pred_11 obj_31 obj_29)
       (pred_11 obj_18 obj_11)
       (pred_11 obj_18 obj_31)
       (pred_11 obj_28 obj_15)
       (pred_11 obj_28 obj_09)
       (pred_11 obj_28 obj_22)
       (pred_11 obj_09 obj_02)
       (pred_11 obj_09 obj_26)
       (pred_11 obj_09 obj_01)
       (pred_11 obj_09 obj_28)
       (pred_11 obj_26 obj_23)
       (pred_11 obj_26 obj_20)
       (pred_11 obj_26 obj_29)
       (pred_11 obj_26 obj_09)
       (pred_11 obj_20 obj_19)
       (pred_11 obj_20 obj_11)
       (pred_11 obj_20 obj_31)
       (pred_11 obj_20 obj_26)
       (pred_11 obj_11 obj_07)
       (pred_11 obj_11 obj_18)
       (pred_11 obj_11 obj_20)
       (pred_11 obj_15 obj_05)
       (pred_11 obj_15 obj_02)
       (pred_11 obj_15 obj_28)
       (pred_11 obj_02 obj_12)
       (pred_11 obj_02 obj_23)
       (pred_11 obj_02 obj_09)
       (pred_11 obj_02 obj_15)
       (pred_11 obj_23 obj_16)
       (pred_11 obj_23 obj_19)
       (pred_11 obj_23 obj_26)
       (pred_11 obj_23 obj_02)
       (pred_11 obj_19 obj_13)
       (pred_11 obj_19 obj_07)
       (pred_11 obj_19 obj_20)
       (pred_11 obj_19 obj_23)
       (pred_11 obj_07 obj_25)
       (pred_11 obj_07 obj_11)
       (pred_11 obj_07 obj_19)
       (pred_11 obj_05 obj_10)
       (pred_11 obj_05 obj_12)
       (pred_11 obj_05 obj_15)
       (pred_11 obj_12 obj_24)
       (pred_11 obj_12 obj_16)
       (pred_11 obj_12 obj_02)
       (pred_11 obj_12 obj_05)
       (pred_11 obj_16 obj_30)
       (pred_11 obj_16 obj_13)
       (pred_11 obj_16 obj_23)
       (pred_11 obj_16 obj_12)
       (pred_11 obj_13 obj_14)
       (pred_11 obj_13 obj_25)
       (pred_11 obj_13 obj_19)
       (pred_11 obj_13 obj_16)
       (pred_11 obj_25 obj_08)
       (pred_11 obj_25 obj_07)
       (pred_11 obj_25 obj_13)
       (pred_11 obj_10 obj_24)
       (pred_11 obj_10 obj_05)
       (pred_11 obj_24 obj_30)
       (pred_11 obj_24 obj_12)
       (pred_11 obj_24 obj_10)
       (pred_11 obj_30 obj_14)
       (pred_11 obj_30 obj_16)
       (pred_11 obj_30 obj_24)
       (pred_11 obj_14 obj_08)
       (pred_11 obj_14 obj_13)
       (pred_11 obj_14 obj_30)
       (pred_11 obj_08 obj_25)
       (pred_11 obj_08 obj_14)
       (pred_10 obj_20)
       (pred_10 obj_08)
       (pred_10 obj_09)
       (pred_12  obj_20 obj_04)
       (pred_12  obj_08 obj_17)
       (pred_12  obj_09 obj_27)
       (pred_8 obj_22)
       (pred_8 obj_01)
       (pred_8 obj_29)
       (pred_8 obj_31)
       (pred_8 obj_18)
       (pred_8 obj_28)
       (pred_8 obj_26)
       (pred_8 obj_11)
       (pred_8 obj_15)
       (pred_8 obj_02)
       (pred_8 obj_23)
       (pred_8 obj_19)
       (pred_8 obj_07)
       (pred_8 obj_05)
       (pred_8 obj_12)
       (pred_8 obj_16)
       (pred_8 obj_13)
       (pred_8 obj_25)
       (pred_8 obj_10)
       (pred_8 obj_24)
       (pred_8 obj_30)
       (pred_8 obj_14)

       (pred_7  obj_03 obj_04)
       (pred_7  obj_21 obj_17)
       (pred_7  obj_06 obj_27)
       (pred_2 obj_03 obj_18)
       (pred_2 obj_21 obj_22)
       (pred_2 obj_06 obj_28)
       (pred_4 obj_31)
    )

    (:goal (and
       (pred_2 obj_03 obj_23)
       (pred_2 obj_21 obj_28)
    ))
(:constraints
  (always (not (pred_4 obj_29)))
)
)

; plan
1. (op_5 obj_31 obj_18)
   deleted: (pred_4 obj_31)
   added: (pred_4 obj_18)
   goals met: 0 of 2
2. (op_1 obj_18 obj_03)
   deleted: (pred_2 obj_03 obj_18) (pred_1)
   added: (pred_6 obj_03)
   goals met: 0 of 2
3. (op_5 obj_18 obj_31)
   deleted: (pred_4 obj_18)
   added: (pred_4 obj_31)
   goals met: 0 of 2
4. (op_2 obj_31 obj_20 obj_03 obj_04)
   deleted: (pred_10 obj_20)
   added: (pred_8 obj_20)
   goals met: 0 of 2
5. (op_5 obj_31 obj_20)
   deleted: (pred_4 obj_31)
   added: (pred_4 obj_20)
   goals met: 0 of 2
6. (op_5 obj_20 obj_26)
   deleted: (pred_4 obj_20)
   added: (pred_4 obj_26)
   goals met: 0 of 2
7. (op_5 obj_26 obj_23)
   deleted: (pred_4 obj_26)
   added: (pred_4 obj_23)
   goals met: 0 of 2
8. (op_5 obj_23 obj_02)
   deleted: (pred_4 obj_23)
   added: (pred_4 obj_02)
   goals met: 0 of 2
9. (op_5 obj_02 obj_15)
   deleted: (pred_4 obj_02)
   added: (pred_4 obj_15)
   goals met: 0 of 2
10. (op_5 obj_15 obj_28)
   deleted: (pred_4 obj_15)
   added: (pred_4 obj_28)
   goals met: 0 of 2
11. (op_5 obj_28 obj_22)
   deleted: (pred_4 obj_28)
   added: (pred_4 obj_22)
   goals met: 0 of 2
12. (op_4 obj_22 obj_21 obj_03)
   deleted: (pred_6 obj_03) (pred_2 obj_21 obj_22)
   added: (pred_6 obj_21) (pred_2 obj_03 obj_22)
   goals met: 0 of 2
13. (op_5 obj_22 obj_28)
   deleted: (pred_4 obj_22)
   added: (pred_4 obj_28)
   goals met: 0 of 2
14. (op_4 obj_28 obj_06 obj_21)
   deleted: (pred_6 obj_21) (pred_2 obj_06 obj_28)
   added: (pred_6 obj_06) (pred_2 obj_21 obj_28)
   goals met: 1 of 2
15. (op_5 obj_28 obj_22)
   deleted: (pred_4 obj_28)
   added: (pred_4 obj_22)
   goals met: 1 of 2
16. (op_4 obj_22 obj_03 obj_06)
   deleted: (pred_6 obj_06) (pred_2 obj_03 obj_22)
   added: (pred_6 obj_03) (pred_2 obj_06 obj_22)
   goals met: 1 of 2
17. (op_5 obj_22 obj_28)
   deleted: (pred_4 obj_22)
   added: (pred_4 obj_28)
   goals met: 1 of 2
18. (op_5 obj_28 obj_15)
   deleted: (pred_4 obj_28)
   added: (pred_4 obj_15)
   goals met: 1 of 2
19. (op_5 obj_15 obj_02)
   deleted: (pred_4 obj_15)
   added: (pred_4 obj_02)
   goals met: 1 of 2
20. (op_5 obj_02 obj_23)
   deleted: (pred_4 obj_02)
   added: (pred_4 obj_23)
   goals met: 1 of 2
21. (op_3 obj_23 obj_03)
   deleted: (pred_6 obj_03)
   added: (pred_1) (pred_2 obj_03 obj_23)
   goals met: 2 of 2
